[
  {
    "slug": "ODPay",
    "company": "ODPay (OkieDokie)",
    "position": "Backend Developer Intern",
    "location": "Remote",
    "startDate": "August 2024",
    "endDate": "Present",
    "duration": "Ongoing",
    "display": true,
    "description": "Backend developer intern building and scaling production systems for a campus automation and payments platform, with a strong focus on performance, reliability, and observability.",
    "responsibilities": [
      "Engineered and optimized 50+ REST APIs using Node.js and Express.js, reducing response times by 50–80% through Redis caching, request batching, and MongoDB aggregation pipelines.",
      "Architected and shipped 3 production-grade backend modules with normalized schemas, ACID-compliant data flows, and automated CI/CD pipelines.",
      "Developed 180+ unit and integration tests using Jest and Supertest, achieving ~60% code coverage and improving regression safety.",
      "Integrated Datadog APM to enable real-time monitoring, structured logging, and automated alerting across backend services.",
      "Implemented OTP delivery using AWS SNS and transactional email workflows via ZeptoMail, supporting authentication flows for 10,000+ users."
    ],
    "skills": [
      "Node.js",
      "Express.js",
      "MongoDB",
      "Redis",
      "REST APIs",
      "System Design",
      "Testing (Jest, Supertest)",
      "CI/CD",
      "Datadog APM",
      "AWS SNS"
    ],
    "highlights": [
      "Reduced API latency by up to 80% through caching and query optimization",
      "Owned end-to-end backend architecture for multiple production modules",
      "Built a robust testing and observability foundation",
      "Scaled authentication and notification systems to 10k+ users"
    ],
    "url": "https://okiedokiepay.com/",
    "logo": "https://okiedokiepay.com/favicon.ico"
  },
  {
    "slug": "IEEESoC",
    "company": "IEEE Summer of Code",
    "position": "Open Source Contributor",
    "location": "Remote",
    "startDate": "May 2025",
    "endDate": "June 2025",
    "duration": "2 months",
    "display": true,
    "description": "Selected for IEEE Summer of Code as an open-source contributor; worked across multiple production-grade codebases spanning backend, frontend, and infrastructure.",
    "responsibilities": [
      "Ranked in the top 10% nationwide among 100+ contributors based on contribution quality, consistency, and impact.",
      "Migrated and refactored core infrastructure modules from Rust to TypeScript for the TensorZero LLM platform, improving maintainability and onboarding speed.",
      "Designed and built a complete full-stack FinTech education module for FinTechForge using React, Express.js, and PostgreSQL.",
      "Established a clean, scalable base architecture for the DebateMate platform following SOLID principles and clean code practices."
    ],
    "skills": [
      "TypeScript",
      "React.js",
      "Express.js",
      "PostgreSQL",
      "Rust",
      "Software Architecture",
      "Clean Code",
      "Open Source Collaboration",
      "CI/CD"
    ],
    "highlights": [
      "Top 10% contributor nationwide in IEEE Summer of Code",
      "End-to-end ownership of a full-stack FinTech module",
      "Improved long-term maintainability of LLM infrastructure",
      "Defined foundational architecture for a multi-user platform"
    ],
    "url": "https://www.ieeesoc.xyz/",
    "logo": "https://www.ieeesoc.xyz/assets/just%20logo-Df-J6RYp.png"
  },
  {
    "slug": "YHills",
    "company": "YHILLS Ed.Tech",
    "position": "Full Stack Developer (Mentorship)",
    "location": "Remote",
    "startDate": "April 2024",
    "endDate": "August 2024",
    "duration": "4 months",
    "display": false,
    "description": "Worked as a full-stack developer under mentorship, building and optimizing MERN-based web applications with a focus on real-world product features.",
    "responsibilities": [
      "Architected and developed a MERN-stack restaurant discovery platform supporting cuisine categorization, search, and filtering.",
      "Built RESTful APIs with Express.js and MongoDB, focusing on performance, scalability, and clean API design.",
      "Improved client-side state management using React Context and Reducer, increasing interaction efficiency by ~25%.",
      "Implemented JWT-based authentication to support secure user login and protected routes.",
      "Actively participated in team development through code reviews, pair programming, and Git-based collaboration."
    ],
    "skills": [
      "React.js",
      "Node.js",
      "Express.js",
      "MongoDB",
      "JWT Authentication",
      "REST APIs",
      "State Management",
      "Git",
      "Team Collaboration"
    ],
    "highlights": [
      "Built a production-style MERN application end to end",
      "Improved UX efficiency through structured state management",
      "Implemented secure authentication workflows",
      "Hands-on experience with collaborative development practices"
    ],
    "url": "https://yhills.com",
    "logo": "https://yhills.com/wp-content/uploads/2024/03/YHills-logo-main.webp"
  }
]
