[
  {
    "title": "Hackverse (Hackathon Organizing Platform)",
    "name": "Hackverse (Under Development)",
    "slug": "hackverse",
    "description": "Hackverse is a scalable and secure hackathon hosting platform that demonstrates my proficiency in full-stack development and adherence to SOLID principles. The project posed several challenges, including implementing robust user authentication and designing a normalized database schema.",
    "category": "Personal Project",
    "year": 2025,
    "tech_stack": [
      "NestJS",
      "Next.js",
      "PostgreSQL (Neon)",
      "Prisma ORM",
      "Passport.js",
      "Redux"
    ],
    "images": [
      "/projects/hackverse/events-dark.png",
      "/projects/hackverse/events-light.png",
      "/projects/hackverse/profile-dark.png",
      "/projects/hackverse/profile-light.png"
    ],
    "preview_link": "https://github.com/adithya-adee/hackverse",
    "project_details": [
      "Developed secure Role-Based Access Control (RBAC) using Passport.js, NestJS guards, and decorators, ensuring granular permission management and robust user authentication.",
      "Designed and optimized a highly normalized PostgreSQL database schema using Prisma ORM, enhancing data storage efficiency and retrieval performance.",
      "Architected a cohesive full-stack application utilizing PostgreSQL (via Neon), React (via Next.js), and Node.js (via NestJS), ensuring scalability and maintainability.",
      "Implemented Redux for global state management, ensuring consistent state across the application and improving user experience."
    ]
  },
  {
    "title": "Medicare Simplified",
    "name": "Medicare Simplified",
    "slug": "medicare-simplified",
    "description": "Medicare Simplified is an e-commerce platform for medicine that showcases my expertise in React and Next.js. The project involved migrating from React.js to Next.js, implementing server-side rendering, and integrating a secure authentication system.",
    "category": "Personal Project",
    "year": 2024,
    "tech_stack": [
      "Next.js",
      "PostgreSQL",
      "Supabase",
      "NextAuth.js",
      "Prisma ORM"
    ],
    "images": [
      "/projects/medicare-simplified/admin-page.png",
      "/projects/medicare-simplified/cart.png",
      "/projects/medicare-simplified/category.png",
      "/projects/medicare-simplified/hero.png",
      "/projects/medicare-simplified/history.png"
    ],
    "preview_link": "https://github.com/adithya-adee/medicare-simplified",
    "project_details": [
      "Spearheaded the migration of the web application from React.js to Next.js, leveraging server-side rendering and API routing to enhance performance and SEO.",
      "Implemented Role-Based Access Control (RBAC) using NextAuth.js and Prisma ORM, providing differentiated user experiences for admin and regular users.",
      "Developed and maintained both front-end and back-end components, ensuring seamless integration between Next.js, PostgreSQL, and extended with Supabase or Neon.",
      "Optimized application performance and user experience, resulting in improved load times and user engagement."
    ]
  },
  {
    "title": "React Learn Project",
    "name": "React Learn Project",
    "slug": "react-learn",
    "description": "The React Learn Project is a personal initiative to enhance my frontend skills using various libraries. The project focuses on showcasing unique design elements and rapid learning capabilities.",
    "category": "Frontend Development",
    "year": 2024,
    "tech_stack": [
      "React",
      "Tailwind CSS",
      "Vercel"
    ],
    "images": [
      "/projects/react-learn/hero.png"
    ],
    "preview_link": "https://react-practice-three-ebon.vercel.app/",
    "project_details": [
      "Utilized React and Tailwind CSS to build responsive and visually appealing user interfaces, demonstrating proficiency in modern frontend development.",
      "Showcased the ability to quickly learn and implement new libraries and frameworks, adapting to evolving frontend development trends.",
      "Emphasized unique design elements, reflecting creativity and attention to user experience."
    ]
  }
]
